a = int(input())

def age(a):
    list_1 = ['', 'один', 'два', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять']
    list_2 = ['', 'одиннадцать', 'двенадцать', 'тринадцать', 'четырнадцать', 'пятнадцать', 'шестнадцать', 'семнадцать', 'восемнадцать', 'девятнадцать']
    list_3 = ['', 'десять', 'двадцать', 'тридцать', 'сорок', 'пятьдест', 'шестьдесят', 'семьдесят', 'восемьдесят', 'девяносто']

    if 0 < a < 10:
        print(list_1[a])

    elif 10 < a < 20:
        print(list_2[a - 10])

    elif 20 <= a < 100 or a == 10:

        print(list_3[a // 10] + ' ' + list_1[a % 10])

    elif 100 <= a < 111 or a == 120:
        print('сто ' + ' ' + list_3[a // 10 - 10] + ' ' + list_1[a % 10])

    elif 111 <= a <= 119:
        print('сто ' + ' ' + list_2[a % 100 - 10])

    else:
        print('error')


age(a)